/*
********************************************************************************
*                   Copyright (c) 2015,anzhiguo
*                         All rights reserved.
*
* File Name：   Hw_grf.h
*
* Description:
*
* History:      <author>          <time>        <version>
*
*    desc:    ORG.
********************************************************************************
*/

#ifndef _HWAPI_GRF_H
#define _HWAPI_GRF_H

typedef volatile struct GRFREG_t
{
    UINT32 GPIO_IO0MUX[4];
    UINT32 GPIO_IO0PULL[4];     //0x10

    UINT32 GPIO_IO1MUX[4];      //0x20
    UINT32 GPIO_IO1PULL[4];

    UINT32 GPIO_IO2MUX[4];      //0x40
    UINT32 GPIO_IO2PULL[4];

    UINT32 GRF_PVTM_CON0;   //GRF_DLL_CON0 0x60
    UINT32 GRF_PVTM_CON1;
    UINT32 GRF_PVTM_CON2;

    UINT32 GRF_PVTM_STATUS0;    //GRF_DLL_STATUS0
    UINT32 GRF_PVTM_STATUS1;    //0x70

    UINT32 PAD0[3];

    UINT32 GRF_USBPHY_CON0;     //0x80
    UINT32 GRF_USBPHY_CON1;
    UINT32 GRF_USBPHY_CON2;
    UINT32 GRF_USBPHY_CON3;
    UINT32 GRF_USBPHY_CON4;     //0x90
    UINT32 GRF_USBPHY_CON5;
    UINT32 GRF_USBPHY_CON6;
    UINT32 GRF_USBPHY_CON7;
    UINT32 GRF_USBPHY_CON8;     //0xa0
    UINT32 GRF_USBPHY_CON9;
    UINT32 GRF_USBPHY_CON10;
    UINT32 GRF_USBPHY_CON11;

    UINT32 GRF_UOC_CON0;        //0xb0
    UINT32 GRF_UOC_CON1;
    UINT32 GRF_UOC_CON2;

    UINT32 GRF_IOMUX_CON;
    UINT32 PAD1;                //0xc0
    UINT32 GRF_INTER_CON0;
    UINT32 PAD2;
    UINT32 GRF_VREF_TRIM_CON;   //0xcc
    UINT32 PAD3[4];             //0xd0 - 0xdc
    UINT32 GRF_SOC_STATUS0;     //0xe0
    UINT32 GRF_SOC_STATUS1;
    UINT32 GRF_SOC_USB_STATUS;  //0xe8
    UINT32 PAD4[3];             //0xec - 0xf4
    UINT32 GRF_PRJ_ID;          //f8
    UINT32 GRF_CPU_ID;

}GRFReg_t, *pGRFReg_t; //将IO mux 放在别处处理

#define Grf     ((GRFReg_t *) GRF_BASE)

/*
*-------------------------------------------------------------------------------
*
*                         GRF memap register define
*
*-------------------------------------------------------------------------------
*/

//GRF_GPIO0A_IOMUX
#define IOMUX_GPIO0A0_RESERVE            ((uint32)(3))
#define IOMUX_GPIO0A0_I2S1B_CLK          ((uint32)(2))
#define IOMUX_GPIO0A0_EMMC_PWREN         ((uint32)(1))
#define IOMUX_GPIO0A0_IO                 ((uint32)(0))

#define IOMUX_GPIO0A1_UART2C_TX          ((uint32)(3))
#define IOMUX_GPIO0A1_I2S1B_LRCK          ((uint32)(2))
#define IOMUX_GPIO0A1_EMMC_CLK           ((uint32)(1))
#define IOMUX_GPIO0A1_IO           		 ((uint32)(0))

#define IOMUX_GPIO0A2_UART2C_RX          ((uint32)(3))
#define IOMUX_GPIO0A2_I2S1B_SCLK         ((uint32)(2))
